# config.py
# 所有配置集中管理

# 特征顺序（和模型开发人员商定的）
'''
！！！！注意！！！！
传给后端的数据为：[性别,体重（kg）,身高（cm）,BMI（kg/m^2）,是否从事体力劳动,
                疾病史,存在家族糖尿病史,
                饮酒频率,饮食是否充足,饮食是否均衡,起夜次数,是否每周进行进行中等以上强度锻炼,
                平均每天坐姿时长（分钟）,工作日平均睡眠小时数,打鼾频率,
                每日食盐摄入程度,每日热量摄入量（kcal）,每日蛋白质摄入量（g）,
                每日碳水摄入量（g）,每日膳食纤维摄入量（g）,每日脂肪摄入量（g）,每日水摄入量（g）,
                血压收缩压（mmHg）,血压舒张压（mmHg）,脉搏（次/分钟）,脉搏是否规律,
                胆固醇（mg/dL）,葡萄糖（mg/dL）,甘油三酯（mg/dL）,肌酐（mg/dL）,
                磷（mg/dL）,钾（mmol/L）,白蛋白（g/dL）,血尿素氮（mg/dL）,
                碳酸氢盐（mmol/L）,钠（mmol/L）,球蛋白（g/dL）,
                白细胞计数（1000个细胞/uL）,红细胞计数（10^6个细胞/µL）,
                血红蛋白（g/dL）,血小板计数（1000 个细胞/µL）]
                传递的内容为一维列表（数组）。
'''
FEATURE_COLS_and_Default_VALUES={
    "性别": {
        "type": "str",
        "necessary": True,
        "default": ""
    },
    "体重（kg）": {
        "type": "float",
        "necessary": True,
        "default": 69.05101811367915,
        "value": 69.05101811367915,
        "min":0
    },
    "身高（cm）": {
        "type": "float",
        "necessary": True,
        "default": 156.5863710181135,
        "value": 156.5863710181135,
        "min":0
    },
    "BMI（kg/m^2）": {
        "type": "float",
        "default":None,
        "value": 26.577501561524095
    },
    "是否从事体力劳动": {
        "type": "bool",
        "default": False,
        "value": 0.16402248594628357
    },

    "疾病史":{
        "type": "str",
        "default": ""
    },
    "存在家族糖尿病史": {
        "type": "bool",
        "default": False,
        "value": 0.11230480949406621
    },

    "饮酒频率": {
        "type": "int",
        "default": 1,
        "value": 1.1925046845721423,
        "min":0,
        "max":4
    },
    "饮食是否充足": {
        "type": "int",
        "default": 3,
        "value": 2.528669581511555,
        "min":1,
        "max":3
    },
    "饮食是否均衡": {
        "type": "bool",
        "default": True,
        "value": 0.895315427857589
    },
    "起夜次数": {
        "type": "int",
        "default": 1,
        "value": 0.7179262960649594,
        "min":0
    },
    "是否每周进行进行中等以上强度锻炼": {
        "type": "bool",
        "default": False,
        "value": 0.3207995003123048
    },
    "平均每天坐姿时长（分钟）": {
        "type": "int",
        "default": 260,
        "value": 260.4493441599001,
        "min":0
    },
    "工作日平均睡眠小时数": {
        "type": "float",
        "default": 5.423110555902561,
        "value": 5.423110555902561,
        "min":0,
        "max":24
    },
    "打鼾频率": {
        "type": "int",
        "default": 1,
        "value": 0.9651467832604622,
        "min":0,
        "max":3
    },

    "每日食盐摄入程度": {
        "type": "int",
        "default": 3,
        "value": 2.672204871955028,
        "min": 1,
        "max": 4
    },
    "每日热量摄入量（kcal）": {
        "type": "int",
        "default": 1789,
        "value": 1789.0705808869457,
        "min": 0
    },
    "每日蛋白质摄入量（g）": {
        "type": "float",
        "default": 65.75476826983142,
        "value": 65.75476826983142,
        "min": 0
    },
    "每日碳水摄入量（g）": {
        "type": "float",
        "default": 216.29321673953842,
        "value": 216.29321673953842,
        "min": 0
    },
    "每日膳食纤维摄入量（g）": {
        "type": "float",
        "default": 13.910256089943745,
        "value": 13.910256089943745,
        "min": 0
    },
    "每日脂肪摄入量（g）": {
        "type": "float",
        "default": 71.75708682073683,
        "value": 71.75708682073683,
        "min": 0
    },
    "每日水摄入量（g）": {
        "type": "int",
        "default": 910,
        "value": 909.5124197376655,
        "min": 0
    },

    "血压收缩压（mmHg）": {
        "type": "float",
        "default": 90.54874037060172,
        "value": 90.54874037060172,
        "min":50,
        "max":280
    },
    "血压舒张压（mmHg）": {
        "type": "float",
        "default": 50.83764313970441,
        "value": 50.83764313970441,
        "min":25,
        "max":180
    },
    "脉搏（次/分钟）": {
        "type": "int",
        "default": 73,
        "value": 73.13504059962523,
        "min":20,
        "max":250
    },
    "脉搏是否规律": {
        "type": "bool",
        "default": True,
        "value": 0.9255465334166146
    },

    "胆固醇（mg/dL）": {
        "type": "int",
        "default": 149,
        "value": 149.31442848219862,
        "min":50,
        "max":600
    },
    "葡萄糖（mg/dL）": {
        "type": "int",
        "default": 73,
        "value": 73.0901936289819,
        "min":40,
        "max":500
    },
    "甘油三酯（mg/dL）": {
        "type": "int",
        "default": 100,
        "value": 99.78276077451592,
        "min":10,
        "max":1000
    },
    "肌酐（mg/dL）": {
        "type": "float",
        "default": 0.6347870081199272,
        "value": 0.6347870081199272,
        "min":0.2,
        "max":10
    },
    "磷（mg/dL）": {
        "type": "int",
        "default": 113,
        "value": 113.26096189881324,
        "min":1,
        "max":200
    },
    "钾（mmol/L）": {
        "type": "float",
        "default": 2.969356652092434,
        "value": 2.969356652092434,
        "min":1,
        "max":10
    },
    "白蛋白（g/dL）": {
        "type": "float",
        "default": 2.9644097439100396,
        "value": 2.9644097439100396,
        "min":1,
        "max":7
    },
    "血尿素氮（mg/dL）": {
        "type": "int",
        "default": 11,
        "value": 10.589506558401,
        "min":1,
        "max":150
    },
    "碳酸氢盐（mmol/L）": {
        "type": "int",
        "default": 19,
        "value": 18.536164896939415,
        "min":5,
        "max":50
    },
    "钠（mmol/L）": {
        "type": "int",
        "default": 102,
        "value": 101.88344784509681,
        "min":50,
        "max":200
    },
    "球蛋白（g/dL）": {
        "type": "float",
        "default": 2.2398251093066834,
        "value": 2.2398251093066834,
        "min":0.5,
        "max":7
    },

    "白细胞计数（1000个细胞/uL）": {
        "type": "float",
        "default": 6.687870081199261,
        "value": 6.687870081199261,
        "min":1,
        "max":500
    },
    "红细胞计数（10^6个细胞/µL）": {
        "type": "float",
        "default": 4.310713304184881,
        "value": 4.310713304184881,
        "min":2,
        "max":7
    },
    "血红蛋白（g/dL）": {
        "type": "float",
        "default": 12.523897564022512,
        "value": 12.523897564022512,
        "min":5,
        "max":20
    },
    "血小板计数（1000 个细胞/µL）": {
        "type": "int",
        "default": 234,
        "value": 234.35427857589008,
        "min":10,
        "max":2000
    }
}

# 输出配置
OUTPUT_FEATURES={
    "患病情况": {
        "type": "str",
        "default": "",
        "value": "哮喘=0.1537788881948782;关节炎=0.19587757651467833;\
        骨质疏松=0.04509681449094316;肾结石=0.0650843222985634;\
        中风=0.030231105559025608;胆结石=0.07108057464084946;\
        蛀牙=0.233104309806371;糖尿病=0.10393504059962523;\
        心力衰竭=0.022485946283572766;支气管炎=0.04497189256714553;\
        感冒=0.15440349781386634;痛风=0.03897564022485946;\
        冠心病=0.029356652092442224;心绞痛=0.017863835103060586;\
        肾衰竭=0.024734540911930045;贫血=0.03760149906308557;\
        丙肝=0.011492816989381637;肠胃炎=0.07133041848844472;\
        脂肪肝=0.014615865084322298;乙肝=0.006870705808869456"
    }
}

# 服务配置
HOST = '0.0.0.0'
PORT = 5000
DEBUG = True